import FAQItem from "../components/questions/Questions"
import styles from "./ForthScreen.module.css"

const ForthScreen = () => {
    const faqData = [
        {
            question: "כמה זמן יקח הפרויקט מההתחלה ועד הסיום?",
            answer: "משך הזמן משתנה לפי היקף העבודה, סוג הנכס ורמת המורכבות. בדרך כלל קל לענות שמדובר בשיפוץ כללי לדירה, ואז מדובר בערך בכ-חצי שנה. אם מדובר בעיצוב חלקי, זה יכול לקחת פחות."
        },
        {
            question: "תוך כמה זמן אפשר להתחיל את העבודה?",
            answer: "בדרך כלל תוך שבועיים אפשר כבר לתאם פגישה ראשונה ולהתחיל לעבוד. תמיד ממליצה לפנות מראש כדי לשריין מקום ולעבוד בלי לחץ."
        },
        {
            question: "כמה זמן לוקח שלב התכנון?",
            answer: "בין חודש לחודשיים/שלושה. כולל מדידות, תכנון ראשוני והצגת סקיצות וקונספט עיצובי. תלוי בהיקף הפרויקט וקבלת ההחלטות של הלקוח. עד כמה מהר הוא יכול להחליט על הסקיצה הסופית ובכמות השינויים שנדרש עד לגיבוש סקיצה."
        },
        {
            question: "כמה עולה השירות שלך?",
            answer: "מאוד תלוי בצורך של הלקוח. האם מדובר בליווי מלא? האם בליווי חלקי? או בפגישה חד פעמית? יש מגוון מסלולים שיכולים לבחור שיתאימו לכל אחד ולכל כיס. אני מתאימה את השירות לפי הצורך, התקציב והיקף הפרויקט."
        },
        {
            question: "מה כלול בתמחור שלך?",
            answer: "שוב תלוי מאוד בבחירת המסלול. ואז אני שולחת הסכם/הצעת מחיר ממש מפורטת לפי סעיפים, שלבים ותנאי תשלום."
        },
        {
            question: "האם תוכלי לעזור לי להעריך את התקציב?",
            answer: "כן. חלק חשוב מהעזרה שלי כולל עזרה גם בבניית תקציב שמתאים ליכולות ולמטרות שלכם. אבל חשוב להבין שהתקציב תלוי בבחירות האישיות שלכם והן יכולות להשפיע משמעותית על העלות הכוללת של הפרויקט. בשלבים הראשונים אנחנו בונים תקציב ראשוני שמבוסס על הניסיון שלי בפרויקטים דומים. אני מסבירה לכם מה טווחי המחירים של חומרים, רהיטים, עבודות קבלן ועוד. כדי שתדעו למה לצפות. בהמשך כשנבחר חומרים, ספקים וסגנון, אז נעשה התאמות כדי לשמור על שליטה ולא לחרוג ממה שמתאים לכם."
        },
        {
            question: "האם את מגיעה לאתר במהלך הבנייה?",
            answer: "כמובן מפעם לפעם בהתאם להתקדמות הפרויקט. אני מגיעה על מנת לעבוד על נקודות חשובות כמו אינסטלציה וחשמל. ומגיעה לוודא שהתוכניות מבוצעות כנדרש. חשוב לציין שאני לא מפקחת בנייה ואני לא מחליפה פיקוח בנייה על טיב החומר והעבודה."
        },
        {
            question: "אפשר לעבוד על חלק מהבית? רק על הסלון?",
            answer: "אפשר ויכול להיות שתתאים פה פגישת הייעוץ שאני מציעה."
        },
        {
            question: "את זמינה לאורך כל התהליך או רק בשלבים?",
            answer: "זמינה לאורך כל התהליך! גם בליווי מלא וגם בפגישת ייעוץ."
        },
        {
            question: "האם זה מתאים לדירה שכורה?",
            answer: "בהחלט! עיצוב נכון יכול לעשות הבדל משמעותי גם בחללים קטנים ודירות שכורות בעזרת פתרונות מודולריים ויצירתיים."
        },
        {
            question: "כדאי לפנות אליך לפני או אחרי שקיבלנו מפתח?",
            answer: "כדאי מאוד לפנות כמה שיותר מוקדם. אפילו לפני קבלת המפתח. זה יאפשר תכנון כמו שצריך, לבחון אלטרנטיבות ולהתכונן לתהליך בלי פשרות ובלי הפתעות."
        },
        {
            question: "את עוזרת לעמוד בתקציב?",
            answer: "אני מלווה אתכם בתכנון מותאם אישית, ומאזנת בין עיצוב, פונקציונליות ותקציב. יש הרבה דרכים לעצב בתקציב מוגבל מבלי להתפשר על התוצאה."
        },
        {
            question: "את עובדת עם בעלי מקצוע משלך?",
            answer: "כן. אני עובדת עם ספקים וקבלנים שאני מכירה וממליצה עליהם. אבל אם יש לכם אנשי מקצוע מועדפים, כמובן שנוכל לשלב גם אותם."
        }
    ];

    return <>
        <div className={styles.title}>שאלות נפוצות</div>
        <div className={styles.description}>אני בטוחה שעלו לכם שאלות לראש במהלך התקופה האחרונה, אז דאגתי לארגן לכם את התשובות לכולן (לחצו על השאלה והתשובה תפתח)</div>
        {faqData.map((faq, index) => (
            <FAQItem key={index} question={faq.question} answer={faq.answer} />
        ))}
    </>
}

export default ForthScreen